Table of Contents
 Class BIMItemsGroup
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
[DataContract]
public class BIMItemsGroup
Inheritance
object
BIMItemsGroup
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Properties
 Id
[DataMember]
public int Id { get; set; }
Property Value
int
 Items
[DataMember]
public List<BIMItemId> Items { get; set; }
Property Value
List<BIMItemId>
 Type
[DataMember]
public RequestedItemsType Type { get; set; }
Property Value
RequestedItemsType
 Edit this page